Repository: feen1e/recipe-app-mobile
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Recipe App
pl: Aplikacja z Przepisami

# greeting
source: Hello, {name}!
pl: Cześć, {name}!

source: Favorites
pl: Ulubione

source: My Collections
pl: Moje kolekcje

source: No favorites yet
pl: Brak ulubionych przepisów

# startFavoriting
source: Start favoriting recipes to see them here!
pl: Oznacz przepisy jako ulubione, aby zobaczyć je tutaj!

source: No collections yet
pl: Brak kolekcji

# createFirstCollection
source: Create your first collection to organize recipes!
pl: Utwórz pierwszą kolekcję, aby uporządkować przepisy!

source: Retry
pl: Ponów

source: Failed to load favorites
pl: Nie udało się załadować ulubionych

source: Failed to load collections
pl: Nie udało się załadować kolekcji

# navHome
source: Home
pl: Start

# navDiscover
source: Discover
pl: Inspiracje

# navProfile
source: Profile
pl: Profil

source: Recipe Feed
pl: Najnowsze przepisy

# discoverRecipesPage
source: Discover Recipes
pl: Odkrywaj przepisy

source: Profile
pl: Profil

source: Edit profile
pl: Edytuj profil

source: Logout
pl: Wyloguj

source: My Recipes
pl: Moje przepisy

source: No recipes yet
pl: Brak przepisów

source: My Ratings
pl: Moje oceny

source: No ratings yet
pl: Brak ocen

# updatedRecipe
source: updated a recipe:
pl: zaktualizował/a przepis:

# createdRecipe
source: created a recipe:
pl: utworzył/a przepis:

source: Error loading recipes
pl: Błąd ładowania przepisów

source: Saving recipe...
pl: Zapisywanie przepisu...

source: Collection details
pl: Szczegóły kolekcji

# noRecipes
source: No recipes found.
pl: Brak znalezionych przepisów.

source: Collections
pl: Kolekcje

source: Recipes
pl: Przepisy

source: Ratings
pl: Oceny

# createRecipePageTitleCreate
source: Create Recipe
pl: Utwórz przepis

# createRecipePageTitleEdit
source: Edit Recipe
pl: Edytuj przepis

source: Recipe Image
pl: Zdjęcie

source: Select recipe image
pl: Wybierz zdjęcie przepisu

source: Recipe Title *
pl: Tytuł *

# pleaseEnterRecipeTitle
source: Please enter a recipe title
pl: Proszę podać tytuł przepisu

# titleMinLength
source: Title must be at least {min} characters
pl: Tytuł musi mieć co najmniej {min} znaków

# titleMaxLength
source: Title must be less than {max} characters
pl: Tytuł musi mieć mniej niż {max} znaków

source: Description
pl: Opis

# descriptionMaxLength
source: Description must be less than {max} characters
pl: Opis musi mieć mniej niż {max} znaków

# ingredientsHeader
source: Ingredients
pl: Składniki

# stepsHeader
source: Steps
pl: Kroki

# errorLoadingUser
source: Error loading user info: {error}
pl: Błąd ładowania informacji o użytkowniku: {error}

# deleteConfirmationTitle
source: Delete recipe
pl: Usuń przepis

# deleteConfirmationMessage
source: Are you sure you want to delete "{title}"?
pl: Czy na pewno chcesz usunąć "{title}"?

source: Ingredients *
pl: Składniki *

source: Add ingredient
pl: Dodaj składnik

# noIngredientsYetContent
source: No ingredients added yet. Tap + to add ingredients.
pl: Brak dodanych składników. Stuknij +, aby dodać składniki.

# ingredient
source: Ingredient {n}
pl: Składnik {n}

# pleaseEnterIngredient
source: Please enter an ingredient
pl: Proszę podać składnik

source: Cooking Steps *
pl: Kroki *

source: Add step
pl: Dodaj krok

# noStepsYetContent
source: No steps added yet. Tap + to add cooking steps.
pl: Brak dodanych kroków. Stuknij +, aby dodać kroki.

# step
source: Step {n}
pl: Krok {n}

# pleaseEnterStep
source: Please enter a cooking step
pl: Proszę podać krok gotowania

source: Update Recipe
pl: Zaktualizuj przepis

source: Create Recipe
pl: Utwórz przepis

source: Please add at least one ingredient
pl: Proszę dodać co najmniej jeden składnik

# pleaseAddAtLeastOneStep
source: Please add at least one cooking step
pl: Proszę dodać co najmniej jeden krok gotowania

# recipeUpdatedSuccess
source: Recipe updated successfully!
pl: Przepis został zaktualizowany!

# recipeCreatedSuccess
source: Recipe created successfully!
pl: Przepis został utworzony!

# failedToSaveRecipe
source: Failed to save recipe: {error}
pl: Nie udało się zapisać przepisu: {error}

source: Switch theme
pl: Zmień motyw

source: Back
pl: Wstecz

source: Save
pl: Zapisz

source: Cancel
pl: Anuluj

source: Delete
pl: Usuń

source: Loading...
pl: Ładowanie...

# error
source: Something went wrong
pl: Coś poszło nie tak

source: Create Collection
pl: Utwórz kolekcję

source: Edit Collection
pl: Edytuj kolekcję

source: Collection name
pl: Nazwa kolekcji

# enterCollectionName
source: Please enter a collection name
pl: Proszę podać nazwę kolekcji

source: Collection description
pl: Opis kolekcji

source: Add from favorites
pl: Dodaj z ulubionych

# addedRecipes
source: Recipes added to collection
pl: Przepisy w kolekcji

source: Username
pl: Nazwa użytkownika

# profileAvatar
source: Avatar
pl: Zdjęcie profilowe
